src/cf/Documents/Продажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>Продажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<AccumulationRegister>
		<Properties>
			<Name>Товары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/Продажа/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Товары Расход
	Движения.Товары.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Товары.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Стоимость = ТекСтрокаТовары.Сумма;
	КонецЦикла;
	
	Движения.Записать();
	
	КонтрольОтрицательныхДвижений(Отказ);


КонецПроцедуры

Процедура КонтрольОтрицательныхДвижений(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыОстатки.Товар,
	               |	ТоварыОстатки.КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.Товары.Остатки(&ДатаДокумента, Товар.Ссылка В (&МассивТоваров)) КАК ТоварыОстатки
	               |ГДЕ
	               |	ТоварыОстатки.КоличествоОстаток < 0";
				   
	Запрос.УстановитьПараметр("МассивТоваров",Товары.ВыгрузитьКолонку("Товар"));
	Запрос.УстановитьПараметр("ДатаДокумента",КонецДня(ТекущаяДата()));
	Результат = Запрос.Выполнить();			   
	Если Не Результат.Пустой() Тогда
		
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Сообщить("Недостаточно товара " + Выборка.Товар + " не хватает " + Выборка.КоличествоОстаток * - 1);
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры
